app/controllers/user_stocks_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ? LIMIT ?  [["ticker", "GOOG"], ["LIMIT", 1]]
INSERT INTO "stocks" ("ticker", "name", "last_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ticker", "GOOG"], ["name", "Alphabet Inc."], ["last_price", 1031.79], ["created_at", "2018-03-30 16:09:29.227102"], ["updated_at", "2018-03-30 16:09:29.227102"]]
---
	def create
		ticker = params[:stock_ticker]
		stock = Stock.find_by_ticker(ticker)
		unless stock.present?
			stock = Stock.new_from_lookup(ticker)
			stock.save
		end
		@user_stock = UserStock.create(user: current_user, stock: stock)

SELECT  "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."user_id" = ? AND "user_stocks"."stock_id" = ? ORDER BY "user_stocks"."id" ASC LIMIT ?  [["user_id", 1], ["stock_id", 1], ["LIMIT", 1]]
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = ?  [["id", 1]]
---
	def destroy
		stock = Stock.find(params[:id])
		@user_stock = UserStock.where(user_id: current_user.id, stock_id: stock.id).first
		@user_stock.destroy